src/main/resources/xml/accommodationSalesServicePort/reconcile/reconcile.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sal="http://sales.accommodation.transferobject.booking.dreams.wdw.com">
   <soapenv:Header/>
   <soapenv:Body>
      <sal:reconcile>
         <request>
            <!--Zero or more repetitions:-->
            <reconcilliationData>
               <!--Optional:-->
               <inventoryRequestId>?</inventoryRequestId>
               <!--Optional:-->
               <tpId>?</tpId>
               <!--Optional:-->
               <tpsId>?</tpsId>
               <!--Optional:-->
               <tcgId>?</tcgId>
               <!--Optional:-->
               <reservationType>?</reservationType>
            </reconcilliationData>
         </request>
         <serviceContext>
            <addressRole>?</addressRole>
            <conversationId>?</conversationId>
            <messageId>?</messageId>
            <party1Id>?</party1Id>
            <party1Type>?</party1Type>
            <party2Id>?</party2Id>
            <party2Type>?</party2Type>
            <pathHostName>?</pathHostName>
            <pathId>?</pathId>
            <principalId>?</principalId>
            <principalMethod>?</principalMethod>
            <principalRole>?</principalRole>
            <principalUri>?</principalUri>
            <principalValue>?</principalValue>
            <requestTimeStamp>?</requestTimeStamp>
            <toAddressRole>?</toAddressRole>
            <userName>?</userName>
         </serviceContext>
      </sal:reconcile>
   </soapenv:Body>
</soapenv:Envelope>
